<template>
  <div class="container protocol">
    <h1>在线测算用户隐私协议</h1>
    <p>
      深圳市易知互联网有限公司已开展了丰富多彩的内容业务，其中包括了在线测算。
      为说明在线测算平台（以下简称平台）会如何收集、使用和存储您的个人信息及您享有何种权利，我们将通过本协议向您阐述相关事宜，其中要点如下：
    </p>
    <h2>1.协议声明</h2>
    <p>
      平台尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，平台会按照本隐私权政策的规定使用和披露您的个人信息。
      平台将以高度的勤勉、审慎义务对待这些信息。
      除本隐私权政策另有规定外，在未征得您事先许可的情况下，平台不会将这些信息对外披露或向第三方提供。<span class="red">同时，</span>平台会不时更新本隐私权政策。
      您在同意平台服务使用协议之时，即视为您已经同意本隐私权政策全部内容，<span class="red">且同意平台对本《在线测算用户隐私协议》做出的更新版本（本协议中有特别约定的内容除外）。</span>
      本隐私权政策属于平台服务使用协议不可分割的一部分。
    </p>
    <h2>2.适用范围</h2>
    <p>
      a)在您使用在线测算平台网络服务时，平台将自动接收并记录您所授权及所输入的信息，包括但不限于您的姓名、生辰八字、微信ID、访问日期和时间、软硬件特征信息等数据；
    </p>
    <h2>3.信息的使用</h2>
    <p>
      在获得您的数据之后，平台会将其上传至服务器，以生成您的测算数据，以便您能够更好地使用服务。
    </p>
    <h2>4.信息披露</h2>
    <p>
      a)未经用户许可，深圳市易知互联网有限公司不会向第三方（深圳市易知互联网有限公司控股或关联、运营合作单位除外）公开、透露用户个人信息。
    </p>
    <p>
      b)根据法律的有关规定，或者行政或司法机构的要求，平台将有可能向第三方或者行政、司法机构披露；
    </p>
    <p>
      c)如您出现违反中国有关法律、法规或者相关规则的情况，需要向第三方披露；
    </p>
    <h2>5.信息存储和交换</h2>
    <p>
      平台收集的有关您的信息和资料将保存在平台及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或平台收集信息和资料所在地的境外并在境外被访问、存储和展示。
    </p>
    <h2>6.信息安全</h2>
    <p>
      a)在使用本平台网络服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。
      如您发现自己的个人信息泄密，请您立即联络平台客服，以便本软件采取相应措施。
    </p>
    <p>
      b)在用户发送信息的过程中和本平台收到信息后，本平台将遵守行业通用的标准来保护用户的私人信息。但是，任何通过因特网发送的信息或电子版本的存储方式都无法确保100%的安全性。因此，本平台会尽力使用商业上可接受的方式来保护用户的个人信息，但不对用户信息的安全作任何担保和保证性承诺。
    </p>
    <h2>7.您的权利</h2>
    <p>
      在您使用在线测算期间，为了您可以更加便捷地访问、更正、删除您的个人信息，同时保障您撤回对个人信息使用的同意的权利，我们在产品设计中为您提供了相应的操作设置，您可以参考下面的指引进行操作，此外，我们还设置了投诉举报渠道，您的意见将会得到及时的处理
    </p>
    <p>
      a)删除个人信息和报告 <br>
      （1）进入测算首页，点击“查询历史订单”；<br>
      （2）截图保留订单信息；<br>
      （3）在产品首页找到联系客服，并通知客服删除。
    </p>
    <p>
      b)投诉举报<br>
      您可以通过客服反馈您的问题，我们将在第一时间回复并尽我们最大的努力解决您的问题。
    </p>
    <h2>8.免责声明</h2>
    <p>
      a)本平台与其他的在线使用的互联网网站一样,也会受到各种不良信息、网络安全和网络故障问题的困扰,包括但不限于：<br>
      （1）其他用户可能会发布诈骗或虚假信息,或者发表有谩骂、诅咒、诋毁、攻击内容的,或者含有淫秽、色情、下流、反动、煽动民族仇恨等让人反感、厌恶的内容的非法言论；<br>
      （2）其他用户可能会发布一些侵犯您或者其他第三方知识产权、肖像权、姓名权、名誉权、隐私权和/或其他合法权益的图片、照片、文字等资料；<br>
      （3）面临着诸如黑客攻击、计算机病毒困扰、系统崩溃、网络掉线、网速缓慢、程序漏洞等问题的困扰和威胁。例如，可能存在的百度快照抓取测算结果行为，这个是百度收录机制造成，并非我们主动泄露测算结果。同时，我们已在技术上防止搜索引擎收录测算结果，严格保护您的测算数据，请您放心，如您发现自己的测算结果被百度快照收录，请点击：
      <a
        class="a-link"
        href="http://help.baidu.com/webmaster/add"
      >http://help.baidu.com/webmaster/add</a>提交反馈，百度方确认后会进行删除。
    </p>
    <p>
      b)您充分理解到：本协议上述的各种不良信息、网络安全和网络故障问题,并不是本平台或深圳市易知互联网有限公司所导致的问题,由此可能会造成您感到反感、恶心、呕吐等精神损害,或者给您造成其他的损失,概由您自行承担,本平台或深圳市易知互联网有限公司无须向您承担任何责任。
    </p>
    <h2>9.变更</h2>
    <p>
      我们可能会适时对本声明进行修订。当声明的条款发生变更时，将会在网页的重要位置上提示修改内容。请您注意，只有在您勾选同意按钮后，我们才会按照更新后的声明收集、使用、存储您的个人信息。
    </p>
    <h2>10.其他</h2>
    <p>
      在线测算用户隐私条款中所规定的用户权利及信息安全保障措施均适用于在线测算平台全体用户。
    </p>
    <h2>11.与我们联系</h2>
    <p>
      当您有其他的投诉、建议、未成年人个人信息相关问题时，请通过平台客服与我们联系。
      您也可以将您的问题通过深圳市易知互联网有限公司平台旗下产品首页的联系客服反馈或电话<span class="red">0755-26924320</span>告知我们，我们将尽快审核所涉问题，并在验证您的用户身份后的3-5个工作日内予以回复。
    </p>

    <button
      class="confirm-btn"
      @click="$router.back()"
    >
      我已阅读完并同意
    </button>
  </div>
</template>

<script>
  export default {
    name: 'Protocol',
    mounted () {
      document.getElementById('complain-btn').style.display='none'
    },
    destroyed () {
      document.getElementById('complain-btn').removeAttribute('style')
    }
  }
</script>

<style scoped>
  .container{
    background-color: #fff;
    min-height: 100vh;
    color: #383838;
    padding: 0 0.2rem;
    overflow: hidden;
  }
  #complain-btn{
    display: none!important;
  }
  .protocol h1{
    font-size: 0.36rem;
    font-weight: bold;
    padding: 0.25rem 0;
    text-align: center;
    color: #000;
  }
  .protocol h2{
    font-size: 0.32rem;
    font-weight: 500;
    color: #000;
    padding-bottom: 0.2rem;
  }

  .protocol p{
    letter-spacing: 0.02rem;
    line-height: 0.42rem;
    font-size: 0.3rem;
    text-align: justify;
    margin-bottom: 0.2rem;
    word-break: break-all;
  }
  .protocol .red{
    /*color: rgb(255, 1, 1);*/
  }
  .a-link{
    color:inherit;
    text-decoration: underline;
    display: inline!important;
  }
  .confirm-btn{
    background-color: #02c900;
    border-radius: 0.1rem;
    display: block;
    width: 4.6rem;
    padding: 0.2rem 0;
    margin: 0.5rem auto;
    color: #fff;
    font-size: 0.36rem;
  }
</style>
